witalis3/UA3REO-DDC-Transceiver/STM32/Src/functions.c
#include "functions.h"
#include "stm32h7xx_hal.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <math.h>
#include "arm_math.h"
#include "fpga.h"
#include "trx_manager.h"
#include "usbd_debug_if.h"
#include "usbd_cat_if.h"
#include "lcd.h"

CPULOAD_t CPU_LOAD = {0};
volatile bool SPI_DMA_TXRX_ready_callback = false;

void readFromCircleBuffer32(uint32_t *source, uint32_t *dest, uint32_t index, uint32_t length, uint32_t words_to_read)
{
	if (index >= words_to_read)
	{
		dma_memcpy32(&dest[0], &source[index - words_to_read], words_to_read);
	}
	else
	{
		uint_fast16_t prev_part = words_to_read - index;
		dma_memcpy32(&dest[0], &source[length - prev_part], prev_part);
		dma_memcpy32(&dest[prev_part], &source[0], (words_to_read - prev_part));
	}
}

void readHalfFromCircleUSBBuffer24Bit(uint8_t *source, int32_t *dest, uint32_t index, uint32_t length)
{
	uint_fast16_t halflen = length / 2;
	uint_fast16_t readed_index = 0;
	if (index >= halflen)
	{
		for (uint_fast16_t i = (index - halflen); i < index; i++)
		{
			dest[readed_index] = (source[i * 3 + 0] << 8) | (source[i * 3 + 1] << 16) | (source[i * 3 + 2] << 24);
			readed_index++;
		}
	}
	else
	{
		uint_fast16_t prev_part = halflen - index;
		for (uint_fast16_t i = (length - prev_part); i < length; i++)
		{
			dest[readed_index] = (source[i * 3 + 0] << 8) | (source[i * 3 + 1] << 16) | (source[i * 3 + 2] << 24);
			readed_index++;
		}
		for (uint_fast16_t i = 0; i < (halflen - prev_part); i++)
		{
			dest[readed_index] = (source[i * 3 + 0] << 8) | (source[i * 3 + 1] << 16) | (source[i * 3 + 2] << 24);
			readed_index++;
		}
	}
}

static uint16_t dbg_lcd_y = 0;
static uint16_t dbg_lcd_x = 0;
void print_chr_LCDOnly(char chr)
{
	if (LCD_DEBUG_ENABLED)
	{
		if (chr == '\r')
			return;

		if (chr == '\n')
		{
			dbg_lcd_y += 9;
			dbg_lcd_x = 0;
			if (dbg_lcd_y >= LCD_HEIGHT)
			{
				dbg_lcd_y = 0;
				LCDDriver_Fill(BG_COLOR);
			}
			return;
		}

		LCDDriver_drawChar(dbg_lcd_x, dbg_lcd_y, chr, COLOR_RED, BG_COLOR, 1);
		dbg_lcd_x += 6;
	}
}

void print_flush(void)
{
	uint_fast16_t tryes = 0;
	while (DEBUG_Transmit_FIFO_Events() == USBD_BUSY && tryes < 512)
		tryes++;
}

void print_hex(uint8_t data, bool _inline)
{
	char tmp[50] = ""; //-V808
	if (_inline)
		sprintf(tmp, "%02X", data);
	else
		sprintf(tmp, "%02X\n", data);
	print(tmp);
}

void print_bin8(uint8_t data, bool _inline)
{
	char tmp[50] = ""; //-V808
	if (_inline)
		sprintf(tmp, "%c%c%c%c%c%c%c%c", BYTE_TO_BINARY(data));
	else
		sprintf(tmp, "%c%c%c%c%c%c%c%c\n", BYTE_TO_BINARY(data));
	print(tmp);
}

void print_bin16(uint16_t data, bool _inline)
{
	char tmp[50] = ""; //-V808
	if (_inline)
		sprintf(tmp, "%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c", BIT16_TO_BINARY(data));
	else
		sprintf(tmp, "%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c\n", BIT16_TO_BINARY(data));
	print(tmp);
}

void print_bin26(uint32_t data, bool _inline)
{
	char tmp[50] = ""; //-V808
	if (_inline)
		sprintf(tmp, "%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c", BIT26_TO_BINARY(data));
	else
		sprintf(tmp, "%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c\n", BIT26_TO_BINARY(data));
	print(tmp);
}

uint32_t getRXPhraseFromFrequency(int32_t freq, uint8_t rx_num) // calculate the frequency from the phrase for FPGA (RX1 / RX2)
{
	if (freq < 0)
		return 0;
	bool inverted = false;
	int32_t _freq = freq;
	if (_freq > ADC_CLOCK / 2) // Go Nyquist
	{
		while (_freq > (ADC_CLOCK / 2))
		{
			_freq -= (ADC_CLOCK / 2);
			inverted = !inverted;
		}
		if (inverted)
		{
			_freq = (ADC_CLOCK / 2) - _freq;
		}
	}
	if (rx_num == 1)
		TRX_RX1_IQ_swap = inverted;
	if (rx_num == 2)
		TRX_RX2_IQ_swap = inverted;
	float64_t res = round(((float64_t)_freq / (float64_t)ADC_CLOCK) * (float64_t)4294967296); // freq in hz/oscil in hz*2^bits (32 now);
	return (uint32_t)res;
}

uint32_t getTXPhraseFromFrequency(float64_t freq) // calculate the frequency from the phrase for FPGA (TX)
{
	if (freq < 0)
		return 0;
	bool inverted = false;
	int32_t _freq = (int32_t)freq;

	uint8_t nyquist = _freq / (DAC_CLOCK / 2);
	if (nyquist == 0) // <99.84mhz (good 0mhz - 79.872mhz) 0-0.4 dac freq
	{
		TRX_DAC_HP2 = false; // low-pass
	}
	if (nyquist == 1) // 99.84-199.68mhz (good 119.808mhz - 159.744mhz) dac freq - (0.2-0.4 dac freq)
	{
		TRX_DAC_HP2 = true; // high-pass
	}

	if (_freq > (DAC_CLOCK / 2)) // Go Nyquist
	{
		while (_freq > (DAC_CLOCK / 2))
		{
			_freq -= (DAC_CLOCK / 2);
			inverted = !inverted;
		}
		if (inverted)
		{
			_freq = (DAC_CLOCK / 2) - _freq;
		}
	}
	TRX_TX_IQ_swap = inverted;

	float64_t res = round((float64_t)_freq / (float64_t)DAC_CLOCK * (float64_t)4294967296); // freq in hz/oscil in hz*2^NCO phase bits (32 now)
	return (uint32_t)res;
}

void addSymbols(char *dest, char *str, uint_fast8_t length, char *symbol, bool toEnd) // add zeroes
{
	char res[50] = "";
	strcpy(res, str);
	while (strlen(res) < length)
	{
		if (toEnd)
			strcat(res, symbol);
		else
		{
			char tmp[50] = "";
			strcat(tmp, symbol);
			strcat(tmp, res);
			strcpy(res, tmp);
		}
	}
	strcpy(dest, res);
}

float32_t log10f_fast(float32_t X)
{
	float32_t Y, F;
	int32_t E;
	F = frexpf(fabsf(X), &E);
	Y = 1.23149591368684f;
	Y *= F;
	Y += -4.11852516267426f;
	Y *= F;
	Y += 6.02197014179219f;
	Y *= F;
	Y += -3.13396450166353f;
	Y += E;
	return (Y * 0.3010299956639812f);
}

float32_t db2rateV(float32_t i) // from decibels to times (for voltage)
{
	return powf(10.0f, (i / 20.0f));
}

float32_t db2rateP(float32_t i) // from decibels to times (for power)
{
	return powf(10.0f, (i / 10.0f));
}

float32_t rate2dbV(float32_t i) // times to decibels (for voltage)
{
	return 20 * log10f_fast(i);
}

float32_t rate2dbP(float32_t i) // from times to decibels (for power)
{
	return 10 * log10f_fast(i);
}

#define VOLUME_LOW_DB (-40.0f)
#define VOLUME_EPSILON powf(10.0f, (VOLUME_LOW_DB / 20.0f))
float32_t volume2rate(float32_t i) // from the position of the volume knob to the gain
{
	float32_t mute_zone = 15.0f;
	if (MAX_VOLUME_VALUE == 100.0f)
		mute_zone = 1.0f;

	if (i < (mute_zone / MAX_VOLUME_VALUE)) // mute zone
		return 0.0f;

	return powf(VOLUME_EPSILON, (1.0f - i));
}

void shiftTextLeft(char *string, uint_fast16_t shiftLength)
{
	uint_fast16_t size = strlen(string);
	if (shiftLength >= size)
	{
		dma_memset(string, '\0', size);
		return;
	}
	for (uint_fast16_t i = 0; i < size - shiftLength; i++)
	{
		string[i] = string[i + shiftLength];
		string[i + shiftLength] = '\0';
	}
}

float32_t getMaxTXAmplitudeOnFreq(uint32_t freq)
{
	if (freq > MAX_TX_FREQ_HZ)
		return 0.0f;

	uint16_t calibrate_level = 0;

	if (freq < 1.0 * 1000000)
		calibrate_level = CALIBRATE.rf_out_power_2200m;
	else if (freq < 2.5 * 1000000)
		calibrate_level = CALIBRATE.rf_out_power_160m;
	else if (freq < 5.3 * 1000000)
		calibrate_level = CALIBRATE.rf_out_power_80m;
	else if (freq < 8.5 * 1000000)
		calibrate_level = CALIBRATE.rf_out_power_40m;
	else if (freq < 12.0 * 1000000)
		calibrate_level = CALIBRATE.rf_out_power_30m;
	else if (freq < 16.0 * 1000000)
		calibrate_level = CALIBRATE.rf_out_power_20m;
	else if (freq < 19.5 * 1000000)
		calibrate_level = CALIBRATE.rf_out_power_17m;
	else if (freq < 22.5 * 1000000)
		calibrate_level = CALIBRATE.rf_out_power_15m;
	else if (freq < 26.5 * 1000000)
		calibrate_level = CALIBRATE.rf_out_power_12m;
	else if (freq < 28.0 * 1000000)
		calibrate_level = CALIBRATE.rf_out_power_cb;
	else if (freq < 40.0 * 1000000)
		calibrate_level = CALIBRATE.rf_out_power_10m;
	else if (freq < 80.0 * 1000000)
		calibrate_level = CALIBRATE.rf_out_power_6m;
	else
		calibrate_level = CALIBRATE.rf_out_power_2m;

	if (calibrate_level > 200) // dac driver bias
	{
		calibrate_level -= 200;
		TRX_DAC_DRV_A0 = false;
		TRX_DAC_DRV_A1 = false;
	}
	else if (calibrate_level > 100) // dac driver bias 75%
	{
		calibrate_level -= 100;
		TRX_DAC_DRV_A0 = true;
		TRX_DAC_DRV_A1 = false;
	}
	else if (calibrate_level > 0) // dac driver bias 50%
	{
		TRX_DAC_DRV_A0 = false;
		TRX_DAC_DRV_A1 = true;
	}
	else if (calibrate_level == 0) // dac driver off
	{
		TRX_DAC_DRV_A0 = true;
		TRX_DAC_DRV_A1 = true;
	}

	return (float32_t)calibrate_level / 100.0f;
}

float32_t generateSin(float32_t amplitude, float32_t *index, uint32_t samplerate, uint32_t freq)
{
	float32_t ret = amplitude * arm_sin_f32(*index * F_2PI);
	*index += ((float32_t)freq / (float32_t)samplerate);
	while (*index >= 1.0f)
		*index -= 1.0f;
	return ret;
}

