witalis3/UA3REO-DDC-Transceiver/STM32/Src/functions.c
static uint32_t CPULOAD_startWorkTime = 0;
static uint32_t CPULOAD_startSleepTime = 0;
static uint32_t CPULOAD_WorkingTime = 0;
static uint32_t CPULOAD_SleepingTime = 0;
static uint32_t CPULOAD_SleepCounter = 0;
static bool CPULOAD_status = true; // true - wake up ; false - sleep

void CPULOAD_Init(void)
{
	DBGMCU->CR |= (DBGMCU_CR_DBG_SLEEPD1_Msk | DBGMCU_CR_DBG_STOPD1_Msk | DBGMCU_CR_DBG_STANDBYD1_Msk);
	// allow using the counter
	CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
	// start the counter
	DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
	// zero the value of the counting register
	DWT->CYCCNT = 0;
	CPULOAD_status = true;
}

void CPULOAD_GoToSleepMode(void)
{
	// Add to working time
	CPULOAD_WorkingTime += DWT->CYCCNT - CPULOAD_startWorkTime;
	// Save count cycle time
	CPULOAD_SleepCounter++;
	CPULOAD_startSleepTime = DWT->CYCCNT;
	CPULOAD_status = false;
	// Go to sleep mode Wait for wake up interrupt
	__WFI();
}

void CPULOAD_WakeUp(void)
{
	if (CPULOAD_status)
		return;
	CPULOAD_status = true;
	// Increase number of sleeping time in CPU cycles
	CPULOAD_SleepingTime += DWT->CYCCNT - CPULOAD_startSleepTime;
	// Save current time to get number of working CPU cycles
	CPULOAD_startWorkTime = DWT->CYCCNT;
}

void CPULOAD_Calc(void)
{
	// Save values
	CPU_LOAD.SCNT = CPULOAD_SleepingTime;
	CPU_LOAD.WCNT = CPULOAD_WorkingTime;
	CPU_LOAD.SINC = CPULOAD_SleepCounter;
	CPU_LOAD.Load = ((float)CPULOAD_WorkingTime / (float)(CPULOAD_SleepingTime + CPULOAD_WorkingTime) * 100);
	if (CPU_LOAD.SCNT == 0)
	{
		CPU_LOAD.Load = 100;
	}
	if (CPU_LOAD.SCNT == 0 && CPU_LOAD.WCNT == 0)
	{
		CPU_LOAD.Load = 255;
		CPULOAD_Init();
	}
	// Reset time
	CPULOAD_SleepingTime = 0;
	CPULOAD_WorkingTime = 0;
	CPULOAD_SleepCounter = 0;
}

inline int32_t convertToSPIBigEndian(int32_t in)
{
	return (int32_t)(0xFFFF0000 & (uint32_t)(in << 16)) | (int32_t)(0x0000FFFF & (uint32_t)(in >> 16));
}

inline uint8_t rev8(uint8_t data)
{
	uint32_t tmp = data;
	return (uint8_t)(__RBIT(tmp) >> 24);
}

IRAM2 uint8_t SPI_tmp_buff[8] = {0};
bool SPI_Transmit(SPI_HandleTypeDef *hspi, uint8_t *out_data, uint8_t *in_data, uint32_t count, GPIO_TypeDef *CS_PORT, uint16_t CS_PIN, bool hold_cs, uint32_t prescaler, bool dma)
{
	// SPI speed
	if (hspi->Init.BaudRatePrescaler != prescaler)
	{
		hspi->Init.BaudRatePrescaler = prescaler;
		HAL_SPI_Init(hspi);
	}

	#define SPI_timeout 1000 // HAL_MAX_DELAY
	HAL_GPIO_WritePin(CS_PORT, CS_PIN, GPIO_PIN_RESET);
	HAL_StatusTypeDef res = 0;

	if (count < 100) dma = false;
	
	if (dma)
	{
		uint32_t startTime = HAL_GetTick();
		SPI_DMA_TXRX_ready_callback = false;
		if (in_data == NULL)
		{
			dma_memset(SPI_tmp_buff, 0x00, sizeof(SPI_tmp_buff));
			Aligned_CleanDCache_by_Addr((uint32_t)out_data, count);
			
			if (hspi->hdmarx->Init.MemInc != DMA_MINC_DISABLE)
			{
				hspi->hdmarx->Init.MemInc = DMA_MINC_DISABLE;
				HAL_DMA_Init(hspi->hdmarx);
			}
			if (hspi->hdmatx->Init.MemInc != DMA_MINC_ENABLE)
			{
				hspi->hdmatx->Init.MemInc = DMA_MINC_ENABLE;
				HAL_DMA_Init(hspi->hdmatx);
			}
			res = HAL_SPI_TransmitReceive_DMA(hspi, out_data, SPI_tmp_buff, count);
			
			while (!SPI_DMA_TXRX_ready_callback && ((HAL_GetTick() - startTime) < SPI_timeout))
				CPULOAD_GoToSleepMode();
		}
		else if (out_data == NULL)
		{
			dma_memset(in_data, 0x00, count);
			
			/*if (hspi->hdmarx->Init.MemInc != DMA_MINC_ENABLE)
			{
				hspi->hdmarx->Init.MemInc = DMA_MINC_ENABLE;
				HAL_DMA_Init(hspi->hdmarx);
			}
			if (hspi->hdmatx->Init.MemInc != DMA_MINC_DISABLE)
			{
				hspi->hdmatx->Init.MemInc = DMA_MINC_DISABLE;
				HAL_DMA_Init(hspi->hdmatx);
			}*/
			
			res = HAL_SPI_Receive_IT(hspi, in_data, count);
			while (HAL_SPI_GetState(hspi) != HAL_SPI_STATE_READY && (HAL_GetTick() - startTime) < SPI_timeout) CPULOAD_GoToSleepMode();
			
			//res = HAL_SPI_TransmitReceive_DMA(hspi, SPI_tmp_buff, in_data, count);
			//while (!SPI_DMA_TXRX_ready_callback && ((HAL_GetTick() - startTime) < SPI_timeout)) CPULOAD_GoToSleepMode();
		}
		else
		{
			dma_memset(in_data, 0x00, count);
			Aligned_CleanDCache_by_Addr((uint32_t)out_data, count);
			
			if (hspi->hdmarx->Init.MemInc != DMA_MINC_ENABLE)
			{
				hspi->hdmarx->Init.MemInc = DMA_MINC_ENABLE;
				HAL_DMA_Init(hspi->hdmarx);
			}
			if (hspi->hdmatx->Init.MemInc != DMA_MINC_ENABLE)
			{
				hspi->hdmatx->Init.MemInc = DMA_MINC_ENABLE;
				HAL_DMA_Init(hspi->hdmatx);
			}
			res = HAL_SPI_TransmitReceive_DMA(hspi, out_data, in_data, count);
			
			while (!SPI_DMA_TXRX_ready_callback && ((HAL_GetTick() - startTime) < SPI_timeout))
				CPULOAD_GoToSleepMode();
		}
		Aligned_CleanInvalidateDCache_by_Addr((uint32_t)in_data, count);
		
		if((HAL_GetTick() - startTime) > SPI_timeout)
			res = HAL_TIMEOUT;
	}
	else
	{
		__SPI2_CLK_ENABLE();
		if (in_data == NULL)
		{
			res = HAL_SPI_Transmit_IT(hspi, out_data, count);
		}
		else if (out_data == NULL)
		{
			dma_memset(in_data, 0x00, count);
			res = HAL_SPI_Receive_IT(hspi, in_data, count);
		}
		else
		{
			dma_memset(in_data, 0x00, count);
			res = HAL_SPI_TransmitReceive_IT(hspi, out_data, in_data, count);
		}
		uint32_t startTime = HAL_GetTick();
		while (HAL_SPI_GetState(hspi) != HAL_SPI_STATE_READY && (HAL_GetTick() - startTime) < SPI_timeout)
			CPULOAD_GoToSleepMode();
	}

	if (HAL_SPI_GetError(hspi) != 0)
		res = HAL_ERROR;

	if (!hold_cs)
		HAL_GPIO_WritePin(CS_PORT, CS_PIN, GPIO_PIN_SET);
	
	if (res == HAL_TIMEOUT)
	{
		println("[ERR] SPI timeout");
		return false;
	}
	if (res == HAL_ERROR)
	{
		println("[ERR] SPI error, code: ", hspi->ErrorCode, " COUNT: ", count);
		return false;
	}

	return true;
}

/*
 *  This Quickselect routine is based on the algorithm described in
 *  "Numerical recipes in C", Second Edition,
 *  Cambridge University Press, 1992, Section 8.5, ISBN 0-521-43108-5
 *  This code by Nicolas Devillard - 1998. Public domain.
 */
float32_t quick_median_select(float32_t *arr, int n)
{
	int low, high;
	int median;
	int middle, ll, hh;

	low = 0;
	high = n - 1;
	median = (low + high) / 2;
	for (;;)
	{
		if (high <= low) /* One element only */
			return arr[median];

		if (high == low + 1)
		{ /* Two elements only */
			if (arr[low] > arr[high])
				ELEM_SWAP_F32(arr[low], arr[high]);
			return arr[median];
		}

		/* Find median of low, middle and high items; swap into position low */
		middle = (low + high) / 2;
		if (arr[middle] > arr[high])
			ELEM_SWAP_F32(arr[middle], arr[high]);
		if (arr[low] > arr[high])
			ELEM_SWAP_F32(arr[low], arr[high]);
		if (arr[middle] > arr[low])
			ELEM_SWAP_F32(arr[middle], arr[low]);

		/* Swap low item (now in position middle) into position (low+1) */
		ELEM_SWAP_F32(arr[middle], arr[low + 1]);

		/* Nibble from each end towards middle, swapping items when stuck */
		ll = low + 1;
		hh = high;
		for (;;)
		{
			do
				ll++;
			while (arr[low] > arr[ll]);
			do
				hh--;
			while (arr[hh] > arr[low]);

			if (hh < ll)
				break;

			ELEM_SWAP_F32(arr[ll], arr[hh]);
		}

		/* Swap middle item (in position low) back into correct position */
		ELEM_SWAP_F32(arr[low], arr[hh]);

		/* Re-set active partition */
		if (hh <= median)
			low = ll;
		if (hh >= median)
			high = hh - 1;
	}
}

static uint32_t dma_memset32_reg = 0;
static bool dma_memset32_busy = false;
void dma_memset32(void *dest, uint32_t val, uint32_t size)
{
	if (size == 0)
		return;

	if (dma_memset32_busy) // for async calls
	{
		if (val == 0)
		{
			memset(dest, val, size * 4);
		}
		else
		{
			uint32_t *buf = dest;
			while (size--)
				*buf++ = val;
		}
		return;
	}

	dma_memset32_busy = true;
	dma_memset32_reg = val;
	Aligned_CleanDCache_by_Addr(&dma_memset32_reg, sizeof(dma_memset32_reg));
	Aligned_CleanDCache_by_Addr(dest, size * 4);

	uint32_t max_block = DMA_MAX_BLOCK / 4;
	uint32_t *current_dest = (uint32_t *)dest;
	uint32_t estimated = size;
	while (estimated > 0)
	{
		uint32_t block_size = (estimated > max_block) ? max_block : estimated;
		HAL_MDMA_Start(&hmdma_mdma_channel44_sw_0, (uint32_t)&dma_memset32_reg, (uint32_t)current_dest, 4 * block_size, 1);
		SLEEPING_MDMA_PollForTransfer(&hmdma_mdma_channel44_sw_0);
		estimated -= block_size;
		current_dest += block_size;
	}

	Aligned_CleanInvalidateDCache_by_Addr(dest, size * 4);
	dma_memset32_busy = false;

	/*uint32_t *pDst = (uint32_t *)dest;
	uint8_t errors = 0;
	for(uint32_t i = 0; i < size; i++)
		if(pDst[i] != val && errors < 3)
		{
			println(i);
			errors++;
		}*/
}

void memset16(void *dest, uint16_t val, uint32_t size)
{
	if (size == 0)
		return;

	uint16_t *buf = dest;
	while (size--)
		*buf++ = val;

	/*char *buf = dest;
	union
	{
			uint8_t d8[2];
			uint16_t d16;
	}u16 = {.d16 = val};

