witalis3/UA3REO-DDC-Transceiver/STM32/Src/functions.c
	while(size--)
	{
			*buf++ = u16.d8[0];
			*buf++ = u16.d8[1];
	}*/
}

void dma_memset(void *dest, uint8_t val, uint32_t size)
{
	if (dma_memset32_busy || size < 128) // for async and fast calls
	{
		memset(dest, val, size);
		return;
	}

	// left align
	char *pDst = (char *)dest;
	while ((uint32_t)pDst != (((uint32_t)pDst) & ~(uint32_t)0x3) && size > 0)
	{
		*pDst++ = val;
		size--;
	}

	if (size > 0)
	{
		// center fills in 32bit
		uint32_t val32 = (val << 24) | (val << 16) | (val << 8) | (val << 0);
		uint32_t block32 = size / 4;
		uint32_t block8 = size % 4;
		dma_memset32(pDst, val32, block32);

		// right align
		if (block8 > 0)
		{
			pDst += block32 * 4;
			while (block8--)
				*pDst++ = val;
		}
	}
}

static bool dma_memcpy32_busy = false;
void dma_memcpy32(void *dest, void *src, uint32_t size)
{
	if (size == 0)
		return;

	if (dma_memcpy32_busy) // for async calls
	{
		memcpy(dest, src, size * 4);
		return;
	}

	dma_memcpy32_busy = true;
	Aligned_CleanDCache_by_Addr(src, size * 4);
	Aligned_CleanDCache_by_Addr(dest, size * 4);

	uint8_t res = HAL_MDMA_Start(&hmdma_mdma_channel40_sw_0, (uint32_t)src, (uint32_t)dest, size * 4, 1);
	SLEEPING_MDMA_PollForTransfer(&hmdma_mdma_channel40_sw_0);

	Aligned_CleanInvalidateDCache_by_Addr(dest, size * 4);
	dma_memcpy32_busy = false;

	/*char *pSrc = (char *)src;
	char *pDst = (char *)dest;
	for(uint32_t i = 0; i < size * 4; i++)
		if(pSrc[i] != pDst[i])
			println(size * 4, " ", i);*/
}

void dma_memcpy(void *dest, void *src, uint32_t size)
{
	if (dma_memcpy32_busy || size < 1024) // for async and fast calls
	{
		memcpy(dest, src, size);
		return;
	}

	// left align
	char *pSrc = (char *)src;
	char *pDst = (char *)dest;
	while (((uint32_t)pSrc != (((uint32_t)pSrc) & ~(uint32_t)0x3) || (uint32_t)pDst != (((uint32_t)pDst) & ~(uint32_t)0x3)) && size > 0)
	{
		*pDst++ = *pSrc++;
		size--;
	}

	if (size > 0)
	{
		// center copy in 32bit
		uint32_t block32 = size / 4;
		uint32_t block8 = size % 4;
		uint32_t max_block = DMA_MAX_BLOCK / 4;
		while (block32 > max_block)
		{
			dma_memcpy32(pDst, pSrc, max_block);
			block32 -= max_block;
			pDst += max_block * 4;
			pSrc += max_block * 4;
		}
		dma_memcpy32(pDst, pSrc, block32);

		// right align
		if (block8 > 0)
		{
			pDst += block32 * 4;
			pSrc += block32 * 4;
			while (block8--)
				*pDst++ = *pSrc++;
		}
	}
}

void SLEEPING_MDMA_PollForTransfer(MDMA_HandleTypeDef *hmdma)
{
#define Timeout 100
	uint32_t tickstart;

	if (HAL_MDMA_STATE_BUSY != hmdma->State)
		return;

	/* Get timeout */
	tickstart = HAL_GetTick();

	while (__HAL_MDMA_GET_FLAG(hmdma, MDMA_FLAG_CTC) == 0U)
	{
		if ((__HAL_MDMA_GET_FLAG(hmdma, MDMA_FLAG_TE) != 0U))
		{
			(void)HAL_MDMA_Abort(hmdma); /* if error then abort the current transfer */
			return;
		}

		/* Check for the Timeout */
		if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
		{
			(void)HAL_MDMA_Abort(hmdma); /* if timeout then abort the current transfer */
			return;
		}

		// go sleep
		CPULOAD_GoToSleepMode();
	}

	/* Clear the transfer level flag */
	__HAL_MDMA_CLEAR_FLAG(hmdma, (MDMA_FLAG_BRT | MDMA_FLAG_BT | MDMA_FLAG_BFTC | MDMA_FLAG_CTC));

	/* Process unlocked */
	__HAL_UNLOCK(hmdma);

	hmdma->State = HAL_MDMA_STATE_READY;
}

uint8_t getInputType(void)
{
	uint8_t type = TRX.InputType_MAIN;
	if (CurrentVFO->Mode == TRX_MODE_DIGI_L || CurrentVFO->Mode == TRX_MODE_DIGI_U || CurrentVFO->Mode == TRX_MODE_RTTY || CurrentVFO->Mode == TRX_MODE_IQ)
		type = TRX.InputType_DIGI;
	return type;
}

/* CRC16 table (for SD data) */
static unsigned int sd_crc16_table[256];
/* CRC7 table (for SD commands) */
static unsigned int sd_crc7_table[256];

/* Running CRC16 calculation for a byte. */
unsigned int sd_crc16_byte(unsigned int crcval, unsigned int byte)
{
	return (sd_crc16_table[(byte ^ (crcval >> 8)) & 0xFFU] ^ (crcval << 8)) & 0xFFFFU;
}

/* Running CRC7 calculation for a byte. */
unsigned int sd_crc7_byte(unsigned int crcval, unsigned int byte)
{
	return sd_crc7_table[(byte ^ (crcval << 1)) & 0xFFU];
}

void sd_crc_generate_table(void)
{
	static bool crc_table_generated = false;
	if (crc_table_generated)
		return;
	int crc = 0;
	/* Generate CRC16 table */
	for (uint32_t byt = 0U; byt < 256U; byt++)
	{
		crc = byt << 8;
		for (uint32_t bit = 0U; bit < 8U; bit++)
		{
			crc <<= 1;
			if ((crc & 0x10000U) != 0U)
			{
				crc ^= 0x1021U;
			}
		}
		sd_crc16_table[byt] = (crc & 0xFFFFU);
	}

	/* Generate CRC7 table */
	for (uint32_t byt = 0U; byt < 256U; byt++)
	{
		crc = byt;
		if ((crc & 0x80U) != 0U)
		{
			crc ^= 0x89U;
		}
		for (uint32_t bit = 1U; bit < 8U; bit++)
		{
			crc <<= 1;
			if ((crc & 0x80U) != 0U)
			{
				crc ^= 0x89U;
			}
		}
		sd_crc7_table[byt] = (crc & 0x7FU);
	}
	crc_table_generated = true;
}

void arm_biquad_cascade_df2T_f32_single(const arm_biquad_cascade_df2T_instance_f32 *S, const float32_t *pSrc, float32_t *pDst, uint32_t blockSize)
{
	float32_t *pState = S->pState;
	const float32_t *pCoeffs = S->pCoeffs;
	const float32_t *pIn = pSrc;
	float32_t *pOut = pDst;

	for (uint32_t stage = 0; stage < S->numStages; stage++)
	{
		float32_t b0 = pCoeffs[0];
		float32_t b1 = pCoeffs[1];
		float32_t b2 = pCoeffs[2];
		float32_t a1 = pCoeffs[3];
		float32_t a2 = pCoeffs[4];
		pCoeffs += 5U;

		float32_t d1 = pState[0];
		float32_t d2 = pState[1];

		for (uint32_t sample = 0; sample < blockSize; sample++)
		{
			float32_t Xn1 = *pIn++;

			float32_t acc1 = b0 * Xn1 + d1;
			d1 = b1 * Xn1 + d2 + a1 * acc1;
			d2 = b2 * Xn1 + a2 * acc1;

			*pOut++ = acc1;
		}

		pState[0] = d1;
		pState[1] = d2;
		pState += 2U;

		pIn = pDst;
		pOut = pDst;
	}
}

void arm_biquad_cascade_df2T_f32_IQ(const arm_biquad_cascade_df2T_instance_f32 *I, const arm_biquad_cascade_df2T_instance_f32 *Q, const float32_t *pSrc_I, const float32_t *pSrc_Q, float32_t *pDst_I, float32_t *pDst_Q, uint32_t blockSize)
{
	float32_t *pState_I = I->pState;
	float32_t *pState_Q = Q->pState;
	const float32_t *pCoeffs = I->pCoeffs;
	const float32_t *pIn_I = pSrc_I;
	const float32_t *pIn_Q = pSrc_Q;
	float32_t *pOut_I = pDst_I;
	float32_t *pOut_Q = pDst_Q;

	for (uint32_t stage = 0; stage < I->numStages; stage++)
	{
		float32_t b0 = pCoeffs[0];
		float32_t b1 = pCoeffs[1];
		float32_t b2 = pCoeffs[2];
		float32_t a1 = pCoeffs[3];
		float32_t a2 = pCoeffs[4];
		pCoeffs += 5U;

		float32_t d1_I = pState_I[0];
		float32_t d2_I = pState_I[1];
		float32_t d1_Q = pState_Q[0];
		float32_t d2_Q = pState_Q[1];

		for (uint32_t sample = 0; sample < blockSize; sample++)
		{
			float32_t Xn1_I = *pIn_I++;
			float32_t Xn1_Q = *pIn_Q++;

			float32_t acc1_I = b0 * Xn1_I + d1_I;
			float32_t acc1_Q = b0 * Xn1_Q + d1_Q;

			d1_I = b1 * Xn1_I + d2_I + a1 * acc1_I;
			d1_Q = b1 * Xn1_Q + d2_Q + a1 * acc1_Q;

			d2_I = b2 * Xn1_I + a2 * acc1_I;
			d2_Q = b2 * Xn1_Q + a2 * acc1_Q;

			*pOut_I++ = acc1_I;
			*pOut_Q++ = acc1_Q;
		}

		pState_I[0] = d1_I;
		pState_I[1] = d2_I;
		pState_Q[0] = d1_Q;
		pState_Q[1] = d2_Q;
		pState_I += 2U;
		pState_Q += 2U;

		pIn_I = pDst_I;
		pIn_Q = pDst_Q;
		pOut_I = pDst_I;
		pOut_Q = pDst_Q;
	}
}

char cleanASCIIgarbage(char chr)
{
	if ((chr < ' ') || (chr > 0x7f))
		return 0;
	return chr;
}

bool textStartsWith(const char *a, const char *b)
{
	if (strncmp(a, b, strlen(b)) == 0)
		return 1;
	return 0;
}

void *alloc_to_wtf(uint32_t size, bool reset)
{
	static uint32_t allocated = 0;
	if(reset) {
		allocated = 0;
		dma_memset(print_output_buffer, 0x00, sizeof(print_output_buffer));
	}
	size = (size + 0x03) & ~ 0x03;
	if ((allocated + size) > sizeof(print_output_buffer))
	{
		LCD_showError("WTF ALLOC mem error", true);
	}
	void * p = (void *) ((uint8_t *)print_output_buffer + allocated);
	allocated += size;
	return p;
}
